app/Models/ClimaModel.php

  public function getClimasActivos()
  {
    return $this->where('activo', 1)->findAll();
---
SELECT *
FROM `climas`
WHERE `activo` = 1